app/controllers/dashboard_controller.rb

  def index

    @from = params['from']
    @to = params['to']
    @last_expense = Expense.first.created_at.strftime("%Y-%m-%d")

    records = Expense.select(:amount, :created_at).where("created_at >= ? AND created_at <= ? ","#{@from} 00:00:01","#{@to} 23:59:59")
---
SELECT "expenses"."created_at" FROM "expenses" WHERE ("expenses"."created_at" BETWEEN ? AND ?) ORDER BY "expenses"."created_at" DESC  [["created_at", "2019-04-03"], ["created_at", "2019-05-10"]]
SELECT "expenses"."amount", "expenses"."created_at" FROM "expenses" WHERE ("expenses"."created_at" >= ? AND "expenses"."created_at" < ?) ORDER BY "expenses"."created_at" DESC  [["created_at", nil], ["created_at", nil]]