app/controllers/expenses_controller.rb

  def index

    if (current_user)
      @expenses = Expense.all
      @first_time = @expenses.where(user_id: current_user.id) == []
---
SELECT "expenses".* FROM "expenses" ORDER BY "expenses"."created_at" DESC
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? ORDER BY "expenses"."created_at" DESC  [["user_id", 33]]

  def create

    @expense = Expense.new(expense_params)

    respond_to do |format|
      if @expense.save
---
INSERT INTO "expenses" ("user_id", "amount", "category", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 32], ["amount", 46524.0], ["category", "sdfgfdsg"], ["description", "xcbsfb"], ["created_at", "2019-04-03 13:19:48.937755"], ["updated_at", "2019-04-03 13:19:48.937755"]]

  def update
    respond_to do |format|

      if @expense.update(expense_params)
---
UPDATE "expenses" SET "description" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["description", "dgfffdgdsgdadgadfgadfgdgfdgdgdsgsdfgsdfgdfsgdfsgdfsgdfsgdfsgdfsg"], ["updated_at", "2019-04-03 21:02:30.784905"], ["id", 6]]

  def destroy
    @expense.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 10]]

  def set_expense
    @expense = Expense.find(params[:id])
---
SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? ORDER BY "expenses"."created_at" DESC LIMIT ?  [["id", 14], ["LIMIT", 1]]