app/controllers/users_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? ORDER BY "expenses"."created_at" DESC  [["user_id", 35]]
---
  def expenses_json
    user = User.find_by email: params[:email]
    @expenses = Expense.where(user_id: user.id)