app/controllers/users_controller.rb

  def create
    username = params['user']['username']
    name = params['user']['name']
    email = params['user']['email']
    password = params['user']['password']
    password_confirmation = params['user']['password_confirmation']
    # byebug
    # @user = User.new(user_params)

    @user = User.new(:email => params['user']['email'], :name => params['user']['name'], :username => params['user']['username'], :password => params['user']['password'], :password_confirmation => params['user']['password_confirmation'])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)